src/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Code</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Text</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Проекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//*****************************************************************************************
&НаКлиенте
Процедура ЗагрузитьФайл(Команда) 

	Фильтр = "Внешнаяя обработка (*.epf)|*.epf|"	+ "Внешний отчет (*.erf)|*.erf|"	+ "Конфигурация (*.cf)|*.cf|"	+ "Расширение конфигурации (*.cfe)|*.cfe|";		Диалог = Новый ПараметрыДиалогаПомещенияФайлов("Выберите файл", Ложь, Фильтр);			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбораПодписи", ЭтаФорма);		НачатьПомещениеФайлаНаСервер(Оповещение,,,, Диалог, УникальныйИдентификатор);	
КонецПроцедуры       
//*****************************************************************************************
&НаКлиентеПроцедура ПослеЗакрытияДиалогаВыбораПодписи (ОписаниеФайла, ДопПараметры) Экспорт		Если ОписаниеФайла.ПомещениеФайлаОтменено Тогда 
				Возврат;		
	КонецЕсли;

	Объект.Расширение	 = ОписаниеФайла.СсылкаНаФайл.Расширение; 
	Объект.Наименование	 = ОписаниеФайла.СсылкаНаФайл.Имя; 
		АдресВХранилище = ОписаниеФайла.Адрес;	КонецПроцедуры
//*****************************************************************************************
&НаСервере
Процедура ПередЗаписьюНаСервере()     
	
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) ТОгда						Объект.Файл = новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХранилище));					КонецЕсли;	

КонецПроцедуры
//*****************************************************************************************
